#include <stdio.h>

void main()
{
    int i=1,count=0,x,y,n;
    scanf("%d%d", &x, &y); //รับค่า x , y
    for(i=1; i++;)//infinity loop
    {
        scanf("%d", &n); //รับค่า n เรื่อยๆ
        if(n<0) //ถ้าค่า n ติดลบจะจบloopทันทีหรือจะหยุดรับค่าทันที
        {
            break;
        }
        if(x<=y){ //ถ้าค่า  x น้อยกว่าหรือเท่ากับ y
            if(n>=x && n<=y) //เช็คตัวเลขว่าอยู่ในช่วงตัวเลขที่เราต้องการไหม
            {
                count++; //เพิ่มค่าตัวนับ
            }
        }else if(x>y){ //ถ้าค่า x มากกว่า y 
            if(n<=x && n>=y) //เช็คตัวเลขว่าอยู่ในช่วงตัวเลขที่เราต้องการไหม
            {
                count++; //เพิ่มค่าตัวนับ
            }
        }
    }
    printf("%d", count); //พิมพ์ตัวนัลออกมา
}
